
stressor_icons = {
    "동료와의 경쟁" : "🔥",
    "과제와 학업 부담" : "📑",
    "교수님의 성격" : "👨‍🏫",
    "평가와 시험" : "💯",
    "안 맞는 수업 방식" : "😣",
    "어려운 수업 주제" : "😵",
    "수업 참여" : "🙋‍♀️",
    "제한된 시간" : "⏰",
}

symptoms_icons = {
    "수면 장애" : "🛌",
    "만성 피로" : "🥱",
    "두통" : "🤕",
    "소화 문제" : "💩",
    "손톱 깨물기" : "💅",
    "졸기" : "💤",

    "불안" : "👀",
    "우울감" : "😢",
    "절망감" : "🧎",
    "집중 부족" : "🤪",
    "공격성 증가" : "😈",

    "갈등 및 논쟁" : "🗯️",
    "다른 사람들과 고립" : "🏝️",
    "학업에 대한 무관심" : "🎮",
    "음식 섭취 증가 또는 감소" : "🍕",
}


coping_icons = {
    "당당한 태도" : "😎",
    "계획 수립 및 실행" : "✍️",
    "스스로에게 칭찬" : "👍",
    "종교적 신념" : "🙏",
    "상황에 대한 정보 탐색" : "📋",
    "이야기 나누기" : "📩",
}
